## OpenTofu Plan

**Environment:** `pl-connectivity-dev-weu`
**Directory:** `./03-platform-connectivity/environments/dev-weu`

<details>
<summary>Show Plan Output</summary>

```hcl
data.terraform_remote_state.management: Reading...
data.terraform_remote_state.management: Read complete after 1s

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_resource_group.connectivity will be created
  + resource "azurerm_resource_group" "connectivity" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-connectivity-on-dev-weu-01"
      + tags     = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.flowlogs_storage.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stflowlogsdevweu01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-connectivity-on-dev-weu-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.flowlogs_storage.azurerm_storage_management_policy.this will be created
  + resource "azurerm_storage_management_policy" "this" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "delete-old-flowlogs"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = 30
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
            }

          + filters {
              + blob_types   = [
                  + "blockBlob",
                ]
              + prefix_match = [
                  + "insights-logs-networksecuritygroupflowevent",
                ]
            }
        }
    }

  # module.hub.azurerm_network_security_group.this["ApiManagementSubnet"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-ApiManagementSubnet"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_network_security_group.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-ApplicationGatewaySubnet"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-dns-inbound-co-dev-weu-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-snet-dns-inbound-co-dev-weu-01"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-dns-outbound-co-dev-weu-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-snet-dns-outbound-co-dev-weu-01"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-management-co-dev-weu-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-snet-management-co-dev-weu-01"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-nva-co-dev-weu-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-snet-nva-co-dev-weu-01"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-private-endpoints-co-dev-weu-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-snet-private-endpoints-co-dev-weu-01"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-shared-services-co-dev-weu-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-snet-shared-services-co-dev-weu-01"
      + resource_group_name = "rg-connectivity-on-dev-weu-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["ApiManagementSubnet"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-ApiManagementSubnet"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-ApplicationGatewaySubnet"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["snet-dns-inbound-co-dev-weu-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-snet-dns-inbound-co-dev-weu-01"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["snet-dns-outbound-co-dev-weu-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-snet-dns-outbound-co-dev-weu-01"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["snet-management-co-dev-weu-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-snet-management-co-dev-weu-01"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["snet-nva-co-dev-weu-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-snet-nva-co-dev-weu-01"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["snet-private-endpoints-co-dev-weu-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-snet-private-endpoints-co-dev-weu-01"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_route_table.this["snet-shared-services-co-dev-weu-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-snet-shared-services-co-dev-weu-01"
      + resource_group_name           = "rg-connectivity-on-dev-weu-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub.azurerm_subnet.azure["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.1.0.128/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.azure["AzureFirewallManagement"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.1.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallManagement"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.azure["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.1.0.64/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.azure["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.1.0.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.azure["RouteServerSubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.1.0.192/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "RouteServerSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["ApiManagementSubnet"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.1.128/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ApiManagementSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.1.64/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ApplicationGatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["snet-dns-inbound-co-dev-weu-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.1.224/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dns-inbound-co-dev-weu-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["snet-dns-outbound-co-dev-weu-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.2.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dns-outbound-co-dev-weu-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["snet-management-co-dev-weu-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.2.32/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-management-co-dev-weu-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["snet-nva-co-dev-weu-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.1.192/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-nva-co-dev-weu-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["snet-private-endpoints-co-dev-weu-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.2.64/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-private-endpoints-co-dev-weu-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet.managed["snet-shared-services-co-dev-weu-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.1.2.128/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-shared-services-co-dev-weu-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-weu-01"
      + virtual_network_name                          = "vnet-hub-co-dev-weu-01"
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["ApiManagementSubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-dns-inbound-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-dns-outbound-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-management-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-nva-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-private-endpoints-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-shared-services-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["ApiManagementSubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-dns-inbound-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-dns-outbound-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-management-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-nva-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-private-endpoints-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-shared-services-co-dev-weu-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.1.0.0/20",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "vnet-hub-co-dev-weu-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-connectivity-on-dev-weu-01"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
    }

  # module.hub_flow_logs["ApiManagementSubnet"].azurerm_network_watcher.this will be created
  + resource "azurerm_network_watcher" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "NetworkWatcher_westeurope"
      + resource_group_name = "NetworkWatcherRG"
    }

  # module.hub_flow_logs["ApiManagementSubnet"].azurerm_network_watcher_flow_log.this will be created
  + resource "azurerm_network_watcher_flow_log" "this" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = "westeurope"
      + name                      = "flowlog-nsg-ApiManagementSubnet"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_westeurope"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + tags                      = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
      + target_resource_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 30
          + enabled = true
        }
    }

  # module.hub_flow_logs["ApiManagementSubnet"].azurerm_resource_group.network_watcher will be created
  + resource "azurerm_resource_group" "network_watcher" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "NetworkWatcherRG"
    }

  # module.hub_flow_logs["ApplicationGatewaySubnet"].azurerm_network_watcher.this will be created
  + resource "azurerm_network_watcher" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "NetworkWatcher_westeurope"
      + resource_group_name = "NetworkWatcherRG"
    }

  # module.hub_flow_logs["ApplicationGatewaySubnet"].azurerm_network_watcher_flow_log.this will be created
  + resource "azurerm_network_watcher_flow_log" "this" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = "westeurope"
      + name                      = "flowlog-nsg-ApplicationGatewaySubnet"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_westeurope"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + tags                      = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
      + target_resource_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 30
          + enabled = true
        }
    }

  # module.hub_flow_logs["ApplicationGatewaySubnet"].azurerm_resource_group.network_watcher will be created
  + resource "azurerm_resource_group" "network_watcher" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "NetworkWatcherRG"
    }

  # module.hub_flow_logs["snet-dns-inbound-co-dev-weu-01"].azurerm_network_watcher.this will be created
  + resource "azurerm_network_watcher" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "NetworkWatcher_westeurope"
      + resource_group_name = "NetworkWatcherRG"
    }

  # module.hub_flow_logs["snet-dns-inbound-co-dev-weu-01"].azurerm_network_watcher_flow_log.this will be created
  + resource "azurerm_network_watcher_flow_log" "this" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = "westeurope"
      + name                      = "flowlog-nsg-snet-dns-inbound-co-dev-weu-01"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_westeurope"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + tags                      = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
          + "region"      = "weu"
        }
      + target_resource_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 30
          + enabled = true
        }
    }

  # module.hub_flow_logs["snet-dns-inbound-co-dev-weu-01"].azurerm_resource_group.network_watcher will be created
  + resource "azurerm_resource_group" "network_watcher" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "NetworkWatcherRG"
    }

  # module.hub_flow_logs["snet-dns-outbound-co-dev-weu-01"].azurerm_network_watcher.this will be created
  + reso

... (truncated)
```

</details>

*Triggered by @KrijnvanderBurg in commit fc812875a61ac18cf6982cf334147d4999f08b13*